posts/spotify-vs-apple-music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-30 Fri 14:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spotify vs iTunes music</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <div>Lighthouse - Michael</div>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/">Profile</a></li>
        <li><a href="/">About</a></li>
    </ul>
</nav>
</div>
<div id="content">
<h1 class="title">Spotify vs iTunes music</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org604fa7a">Background</a>
<ul>
<li><a href="#org3304748">What's next?</a></li>
<li><a href="#org3ead482">Finally</a></li>
<li><a href="#org54d7793">Reference:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Stream music become a controversial topic in social media  after Taylor Swift announce to pull her entire catalog off of Spotify.
</p>

</div>

<div id="outline-container-org604fa7a" class="outline-2">
<h2 id="org604fa7a">Background</h2>
<div class="outline-text-2" id="text-org604fa7a">
<p>
Stream music become a controversial topic in social media  after Taylor Swift announce to pull her entire catalog off of Spotify.
</p>
</div>

<div id="outline-container-org3304748" class="outline-3">
<h3 id="org3304748">What's next?</h3>
<div class="outline-text-3" id="text-org3304748">
<p>
I'm not sure when music streaming is get hot. At beginning, [Pandora](<a href="http://en.wikipedia.org/wiki/Pandora_Radio">http://en.wikipedia.org/wiki/Pandora_Radio</a> "Pandora Radio on Wikipedia") is the first stream-music app as i know. However it is ONLY available in US Apple store, and it could not skip such a lot of ads during enjoying music. This app stay in my iPhone less than half a year.(Although one of the biggest problem is you have to use VPN to pretend you are in US.)
</p>

<p>
After that i stop using stream-music app for a long time because most of that app has bad network from China. Buffering is annoyed if you are listening music. And for most Chinese, they do not using such Spotify, Pandora, Rdio or other same service. Most my friend could download FREE music in Baidu or Tencent QQ. Those vendor claim that they own the copyright of the songs they offer to download. However, if you trying to get access to [Baidu Music ](<a href="http://music.baidu.com">http://music.baidu.com</a> "Baidu Music")or [QQ Music](<a href="http://y.qq.com/">http://y.qq.com/</a> "QQ Music"), they do not allow to next. You will get a notice like, the service is not provide to your area.
</p>

<p>
I was being thought as a freak by a lot of my friend because I subscribe Spotify and buy App from App Store and Mac Store for a long time. I do really thought Spotify is really a pretty good service for most people.
</p>

<p>
As I know, Taylor is not first artist who pull her works off of Spotify. This action make me review what benefit Spotify to us and what benefit it  gives to artists.
</p>

<p>
Before Spotify, iTunes store probably is biggest music store. The difference is, if you purchase from iTunes, you own the music and you can download it anytime via iTunes or iPhone. Even you can export to AAC/MP3. But in Spotify, you could not own the music. You ONLY have the right to listen the songs.
</p>

<p>
For listening, iTunes offer 30 seconds free listening at first. Now iTunes offers 90 seconds for users, but if you want full music, you have to pay for that. I could hardly say Spotify has listening before purchase. Spotify limits times of skip during listening and some ads in.
</p>
</div>
</div>

<div id="outline-container-org3ead482" class="outline-3">
<h3 id="org3ead482">Finally</h3>
<div class="outline-text-3" id="text-org3ead482">
<p>
The problem is, if you have Spotify Premium account, will you buy any music?
</p>
</div>
</div>

<div id="outline-container-org54d7793" class="outline-3">
<h3 id="org54d7793">Reference:</h3>
<div class="outline-text-3" id="text-org54d7793">
<ul class="org-ul">
<li><a href="https://www.spotify.com">Spotify</a></li>
<li><a href="http://www.pandora.com/">Pandora Internet Radio</a></li>
<li><a href="http://www.rdio.com/">Rdio</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    footer area
</footer>
</div>
</body>
</html>
